
#include <bits/stdc++.h>

using namespace std;

/*საბავშვო მოედნის გარშემო N
 რაოდენობის სკამია განლაგებული და, რა თქმა უნდა, გადანომრილია 1-დან N
-ის ჩათვლით.
სამმა მეგობარმა, გიგიკომ და გუგიკომ და გივიკომ სხვადასხვა დროს შეიძინეს ბილეთები საბავშვო კონცერტზე დასასწრებად. თითოეულ ბილეთს სკამის ნომერი აწერია.
მეგობრებს ძალიან უნდათ ერთმანეთის გვერდით ჯდომა.
დაწერეთ პროგრამა, რომელიც დაბეჭდავს სიტყვას YES, თუ გიგიკო, გუგიკო და გივიკო ერთმანეთის გვერდით აღმოჩნდებიან, და სიტყვას NO - წინააღმდეგ შემთხვევაში.*/

int main() {
    int N, gig, gug, giv;

    cin >> N >> gig >> gug >> giv;

    if((gig + 1 == gug && gug + 1 == giv) || (gig + 1 == giv && giv + 1 == gug) || (gig == N && gug == 1 && giv == 2) || (gig == N && giv == 1 && gug == 2) || (gig == N && giv == N - 1 && gug == 1) || (gig == N && gug == N - 1 && giv == 1) ||
       (gug + 1 == gig && gig + 1 == giv) || (gug + 1 == giv && giv + 1 == gig) || (gug == N && gig == 1 && giv == 2) || (gug == N && giv == 1 && gig == 2) || (gug == N && giv == N - 1 && gig == 1) || (gug == N && gig == N - 1 && giv == 1) ||
       (giv + 1 == gig && gig + 1 == gug) || (giv + 1 == gug && gug + 1 == gig) || (giv == N && gug == 1 && gig == 2) || (giv == N && gig == 1 && gug == 2) || (giv == N && gug == N - 1 && gig == 1) || (giv == N && gig == N - 1 && gug == 1)){
            cout << "YES";
       }else{
        cout << "NO";
    }
    return 0;
}
