#include <bits/stdc++.h>

using namespace std;

/*
პატარა თამაზს ძალიან უყვარს მათემატიკა და ხშირად ის უცნაურ შეჯიბრებებს აწყობს ხოლმე რიცხვებს შორის.
დღეს ჩვენმა პატარა მათემატიკოსმა ფურცელზე ზედმეტი ფიქრის გარეშე რაღაც რიცხვი დაწერა. ახლა კი სურს ერთმანეთს კენტი და ლუწი ციფრები შეაჯობროს.

თამაშის წესები ასეთია: თუ ფურცელზე დაწერილ რიცხვში ლუწი ციფრების რაოდენობა მეტია კენტი ციფრების რაოდენობაზე, მაშინ ლუწები იგებენ,
თუ კენტები მეტია ლუწებზე, მაშინ კენტები იგენებ, ხოლო თუ ტოლია - მაშინ ფრეა.
*/

int main() {
    string num;
    cin >> num;

    vector <char> even, odd;
    for(int i = 0; i <= num.size() - 1 ; i++){
        if((int)num[i] % 2 == 0)
            even.push_back(num[i]);
        else
            odd.push_back(num[i]);
    }

    if(even.size() > odd.size()){
        cout << "Even";
    }else{
        if(even.size() < odd.size()){
            cout << "Odd";
        }else{
            cout << "Draw";
        }
    }

    return 0;
}
