#include <bits/stdc++.h>

using namespace std;
/*
ბანკომატში არის K ცალი სხვადასხვა ღირებულების უსასრულო რაოდენობის კუპიურა.
ნიკუშას სურს ბანკომატიდან N ღირებულების თანხის გამოტანა, მაგრამ ამჟამად ბანკომატი გაფუჭებულია,
მიტომ ბანკმა დახმარებისთვის თქვენ მოგმართათ.

დაეხმარეთ მათ და დაწერეთ პროგრამა, რომელიც ბანკომატში არსებული კუპიურების გათვალისწინებით, ნიკუშას მისცემს მის მიერ მოთხოვნილ თანხას მინიმალური რაოდენობის კუპიურებით.
*/
int main() {
    int N, M;
    cin >> N >> M;
    vector <int> dp(M + 1, 1000000), a(N + 1);

    for(int i = 1; i <= N; i++)
        cin >> a[i];

    dp[0] = 0;

    for(int i = 1; i <= M; i++){
        for(int j = 1; j <= N; j++){
            if(i - a[j] >= 0){
                dp[i] = min(dp[i], dp[i - a[j]]);
            }
        }
        dp[i]++;
    }

    cout << (dp[M] >= 1000000 ? -1 : dp[M]);

    return 0;
}
