#include <bits/stdc++.h>

using namespace std;

/*
საფეხურიანი კიბის დასაწყისში, მიწაზე, დგას ბაჭია ბაბი. კიბის საფეხურებზე კომბოსტოებია დალაგებული, თითოეულ საფეხურზე შეიძლება სხვადასხვა რაოდენობის კომბოსტო იდოს.
ბაბის უნდა, რაც შეიძლება ბევრი კომბოსტო მოაგროვოს, მაგრამ იცის, რომ კიბეზე ასვლისას უცნაური წესების შესრულება მოუწევს:
თუ რომელიმე საფეხურიდან (ბოლოს გარდა) ბაბიმ კომბოსტოები აიღო, მაშინ შეუძლია მომდევნო საფეხურიდანაც აიღოს, მაგრამ ამის შემდეგ მესამე საფეხური აუცილებლად უნდა გამოტოვოს.
სხვა სიტყვებით რომ ვთქვათ, ბაბის არა აქვს ზედიზედ სამი მომდევნო საფეხურიდან კომბოსტოების აღების უფლება.

გამოტოვებულ საფეხურზე დაბრუნების უფლება, წესების მიხედვით, ბაბის არა აქვს.
დაეხმარეთ მას შეგროვებული კომბოსტოების უდიდესი რაოდენობის დადგენაში.
*/

int main() {
    int N;
    cin >> N;
    vector <long long> a(N);
    for(int i = 0; i < N; i++){
        cin >> a[i];
    }

    vector <long long> dp(N);
    if(N >= 1) dp[0] = a[0];
    if(N >= 2) dp[1] = a[1] + a[0];
    if(N >= 3) dp[2] = max({a[1] + a[0], a[1] + a[2], a[0] + a[2]});

    for(int i = 3; i < N; i++){
        dp[i] = max({dp[i - 1], a[i] + dp[i - 2], dp[i - 3] + a[i - 1] + a[i]});
    }

    cout << dp[N - 1];

    return 0;
}
