#include <bits/stdc++.h>

using namespace std;

/*
მდინარეზე ბორანით გადააქვთ სხვადასხვა ტვირთი. ბორანის ტვირთამწეობა უდრის M ტონას (M-ზე მეტი მასის მქონე ტვირთს ვერ უძლებს).
მდინარესთან, მეორე ნაპირზე გადასატანად მოიტანეს N რაოდენობის სხვადასხვა ტვირთი, რომელთაგან თითოეულის მასა ცნობილია.

დაადგინეთ, მოხერხდება თუ არა ბორანის ერთი გადასვლით ყველა ტვირთის გადატანა მდინარის მეორე ნაპირზე.*/

int main(){
    int M, N;
    cin >> M >> N;
    int a[N];
    int sum = 0;

    for(int i = 0; i < N; i++)
        cin >> a[i];

    for(int i = 0; i < N; i++)
        sum += a[i];

    if(sum <= M)
        cout << "YES";
    else
        cout << "NO";


    return 0;
}



