#include <bits/stdc++.h>

using namespace std;

/*
ფიზკულტურის მასწავლებელმა მოსწავლეები სიმაღლის ზრდადობის მიხედვით დააყენა და ბურთის შემოსატანად გავიდა.
ცელქმა ბავშვებმა მაშინვე გამოიყენეს პირველი ნომერი ცელქობა, ამ ცელქობის წესებში წერია, რომ ყოველმა ლუწი ნომრის მქონე მოსწავლემ ადგილი უნდა გაუცვალოს მის მომდევნო მოსწავლეს.
თუ რომელიმე ლუწი ნომრის მქონე ბავშვს არ ჰყავს მომდევნო მეგობარი, მაშინ, რა თქმა უნდა, ეს ბავშვი ადგილზე რჩება. მოსწავლეთა  დანომრვა იწყება ნულით.

მოცემული გაქვთ მოსწავლეთა სიმაღლების პირველი ნომერი ცელქობის წესებით არეული მასივი, დაწერეთ პროგრამა, რომელიც მოცემულ მასივს დაუბრუნებს პირვანდელ ფორმას.
*/

int main() {
    int N;
    cin >> N;
    vector <int> arr;
    int num;
    for(int i = 0; i < N; i++){
        num = 0;
        cin >> num;
        arr.push_back(num);
    }

    for(int i = 1; i < N; i++){
        if(arr[i] < arr[i - 1]){
            int temp = arr[i - 1];
            arr[i - 1] = arr[i];
            arr[i] = temp;
        }
    }

    for(int i = 0; i < N; i++){
        cout << arr[i] << " ";
    }

    return 0;
}

