#include <bits/stdc++.h>

using namespace std;

/*
ათობით რიცხვს ეწოდება ათობით-ორობითი რიცხვი, თუ ის შედგება მხოლოდ 0 და 1 ციფრებისგან. მაგალითად: 10 და 1101 ათობით-ორობითია, ხოლო 112 და 3001 არა.

მოცემულია N დადებითი ათობითი რიცხვი, გამობეჭდეთ მინიმალური რაოდენობა ათობით-ორობითი რიცხვებისა, რომელთა ჯამიც იქნება N−ის ტოლი.

ათობით-ორობითი რიცხვი შესაძლოა 0-თაც იწყებოდეს. მაგალითად: 000101 ვალიდური ათობით-ორობითი რიცხვია.
*/

int main() {
    string str;
    cin >> str;
    int mx = 0;

    for(int i = 0; i< str.size(); i++){
        mx = max(mx, (str[i] - '0'));
    }

    cout << mx;

    return 0;
}
