#include <bits/stdc++.h>

using namespace std;

/*მდინარეზე ბორანით გადააქვთ სხვადასხვა ტვირთი. ბორანის ტვირთამწეობა უდრის M ტონას (M-ზე მეტი მასის მქონე ტვირთს ვერ უძლებს).
მდინარესთან, მეორე ნაპირზე რიგში დგას N რაოდენობის სხვადასხვა ტვირთი, რომელთაგან თითოეულის მასა ცნობილია.

დაადგინეთ, რა რაოდენობის ტვირთის გადატანა მოხერხდება მდინარის მეორე ნაპირზე, ბორანის მხოლოდ პირველი გადასვლით, თუ ცნობილია, რომ ტვირთების რიგის დარღვევა არ შეიძლება.*/

int main(){
    int M, N;
    cin >> M >> N;
    int a[N];
    int sum = 0;
    for(int i = 0; i < N; i++)
        cin >> a[i];

    for(int i = 0; i < N; i++)
    {
        sum += a[i];
        if(sum > M)
        {
            cout << i;
            break;
        }
    }

    if(sum <= M)
        cout << N;



    return 0;
}




