#include <bits/stdc++.h>

using namespace std;

/*მოცემულია წყვილ-წყვილად განსხვავებული მთელი რიცხვებისაგან შედგენილი n ელემენტიანი მასივი a1,a2,...,an.
მასივში ორი ელემენტი ქმნის ინვერსიას თუ i<j  და  ai>aj.
მაგალითად, განვიხილოთ მასივი 3,1,2,4 აღნიშნულ მასივში ინვერსიას ქმნის (1,2);(1,3);  ინდექსთა წყვილები.

იპოვეთ ინვერსიების რაოდენობა შემოსულ მასივში.*/

int main(){
    int n;
    cin >> n;
    int a[n];
    int cnt = 0;

    for(int i = 0; i < n; i++){
        cin >> a[i];
    }

    for(int i = 0; i < n; i++){
        for(int j = i + 1; j < n; j++){
            if(a[i] > a[j])
                cnt++;

        }
    }

    cout << cnt;


    return 0;
}





