#include <bits/stdc++.h>

using namespace std;
/*
საქართველოს ალპინისტთა ფედერაციამ გადაწყვიტა მორიგი ექსპედიცია გაეგზავნა მყინვარწვერის კიდევ ერთხელ დასალაშქრად. უშუალოდ მწვერვალზე ასვლის დაწყებამდე საჭიროა S
 კგ ტვირთის საბაზო ბანაკში კონტეინერებით გადატანა, რომელთა გამქირავებელ ფირმას აქვს N
 რაოდენობის განსხვავებული ტევადობის კონტეინერი. მათგან უმცირესის ტევადობა 1 კგ-ია.
 ფირმას თითოეული ტევადობის კონტეინერი განუსაზღვრელი რაოდენობით აქვს. საქმე ისაა, რომ კონტეინერთა გაქირავების ფასი მათ რაოდენობაზეა დამოკიდებული და არა ტევადობაზე.
  ამიტომ, ცხადია, ალპინისტთა ფედერაციას ისე სურს ისინი შეარჩიოს, რომ მათი რაოდენობა მინიმალური იყოს.

დაწერეთ პროგრამა, რომელიც S - ის, N - ის და განსხვავებული კონტეინერების ტევადობათა მოცემული მნიშვნელობებისათვის დაადგენს კონტეინერთა იმ მინიმალურ რაოდენობას,
რომლებიც უნდა დაიქირაოს საქართველოს ალპინისტთა ფედერაციამ ბარგის ისე გადასატანად, რომ ყველა კონტეინერი სავსე იყოს.
*/
int main() {
    int N, M;
    cin >> M >> N;
    vector <int> dp(M + 1, 1000000), a(N + 1);

    for(int i = 1; i <= N; i++)
        cin >> a[i];

    dp[0] = 0;

    for(int i = 1; i <= M; i++){
        for(int j = 1; j <= N; j++){
            if(i - a[j] >= 0){
                dp[i] = min(dp[i], dp[i - a[j]]);
            }
        }
        dp[i]++;
    }

    cout << (dp[M] >= 1000000 ? -1 : dp[M]);

    return 0;
}
