#include <bits/stdc++.h>

using namespace std;

/*
მეორეკლასელებს დიდი არითმეტიკული გამოსახულება აქვთ. სად იპოვეს, ან ვინ მისცათ, უცნობია, მაგრამ ცნობილია, რომ გამოსახულება შეიცავს ფრჩხილებსაც.

მეორეკლასელებს აინტერესებთ (!!!), სწორადაა თუ არა ფრჩხილები ჩაწერილი ამ გამოსახულებაში, ამ მიზნით ამოშალეს ყველა სხვა სიმბოლო და დატოვეს მხოლოდ ფრჩხილები (ყველა ფრჩხილი მრგვალია),
 ამის შემდეგ მოიტანეს ჩვენთან შესამოწმებლად.

რადგან მიღებული სტრიქონი საკმაოდ დიდია (500 სიმბოლომდე), ამიტომაც უმჯობესია პროგრამის დაწერა, რომელიც შეამოწმებს ფრჩხილების სისწორეს.

ცნობილია, რომ:
1. () ეს გამოსახულება სწორია;
2. ორი სწორი გამოსახულების ერთმანეთზე გადაბმით (ნებისმიერი თანმიმდევრობით) მიიღება სწორი გამოსახულება;
3. თუ ნებისმიერ სწორ გამოსახულებას ჩავსვამთ მრგვალ ფრჩხილებში, მიიღება სწორი გამოსახულება.

მეორეკლასელების გამოსახულება შეიცავს მხოლოდ მრგვალ ფრჩხილებს.
*/

int main() {
    string str;
    cin >> str;

    int cnt = 0;
    for(int i = 0; i < str.size(); i++){
        if(str[i] == '(')
            cnt++;
        else cnt--;

        if(cnt < 0){
            cout << "NO";
            exit(0);
        }
    }
    cout << (cnt ? "NO" : "YES");

    return 0;
}
