#include <bits/stdc++.h>

using namespace std;

/*
ასტერიქსი და ობელიქსი გალის მცხოვრებლები არიან. ისინი ძალიან ძლიერი ბიჭები არიან და ეს იმის დამსახურებაა, რომ მათ უზომოდ ბევრის ჭამა უყვართ.

ერთ დღესაც ობელიქსმა გადაწყვიტა ასტერიქსი ტორტების სახლში, გურმანში წაეყვანა. შემდეგ მოილაპარაკეს, რომ სულ ჯამურად N
 ცალ ტორტს შეჭამდნენ (შესაძლოა ერთ-ერთმა მათგანმა საერთოდ არ ჭამოს ტორტი). თუმცა ამავდროულად მეგობრებს სურთ, რომ რაც შეიძლება მალე მოამთავრონ ტორტების ჭამა.
ვიცით, რომ ასტერიქსს ერთი ტორტის სრულად გადასანსლვა a წამში შეუძლია, ხოლო ობელიქსს - b წამში.

დაეხმარეთ ასტერიქსს და ობელიქსს გაარკვიონ, მინიმუმ რამდენ წამში შეძლებენ ისინი N ცალი ტორტის შეჭმას.

პ. ს. გურმანში ტორტების ულიმიტო რაოდენობა აქვთ...
*/

int main() {
    long long N, a, b;
    cin >> N >> a >> b;

    long long x, l, r, m, cks;
    l = 0;
    r = min(a, b) * N;
    while(l < r){
        m = (l + r) / 2;
        cks = m/a + m/b;
        if(cks < N){
            l = m + 1;
        }else r = m;
    }

    cout << l;
    return 0;
}

