#include <bits/stdc++.h>

using namespace std;

/*
ქალაქ ჩეს ცენტრში საფეხმავლო ქუჩაა - მოსეირნეთა ერთ-ერთი ყველაზე პოპულარული ადგილი. აქ სეირნობა ძალიან სასიამოვნოა, რადგან ამ ქუჩაზე  n  ცალი საინტერესო ძეგლია.

გოგონას თავისი ორი სკოლელი ვაჟი მოსწონს, მაგრამ მათ შორის არჩევანს ვერ აკეთებს.
ბოლოს გადაწყვიტა, ორივესთვის ერთსა და იმავე დროს დაენიშნა შეხვედრა, გოგონას უნდა ორი ძეგლის არჩევა, სადაც ბიჭები დაელოდებიან.
ამასთან ეს ძეგლები ისეთი უნდა იყოს, რომ ბიჭებმა ერთმანეთი ვერ შენიშნონ. ნისლის გამო ბიჭები ერთმანეთს დაინახავენ მხოლოდ იმ შემთხვევაში, თუ მათ შორის მანძილი არ აღემატება r მეტრს.

გოგონას აინტერესებს, ორი ძეგლის არჩევის რამდენი ვარიანტი აქვს მას.
*/

int main() {
    long long n, v;
    cin >> n >> v;
    vector <long long> a(n + 1);
    for(int i = 1; i <= n; i++){
        cin >> a[i];
    }

    long long l, r, m, x, cnt = 0;

    for(int i = 1; i <= n; i++){
        x = a[i] + v + 1;
        l = 1;
        r = n;

        while(l < r){
            m = (l + r) / 2;
            if(a[m] < x){
                l = m + 1;
            }else r = m;
        }
        if(a[l] >= x)
            cnt += n - l + 1;
    }

    cout << cnt;
    return 0;
}
