#include <bits/stdc++.h>

using namespace std;

/*
ფიცარზე წრფივად, ერთ რიგში დაჭედებულია ლურსმნები. შეგვიძლია ნებისმიერი ორი მეზობელი ლურსმანი დავაკავშიროთ ძაფით,
რის შემდეგაც ორივე ლურსმანს მობმული ექნება ძაფი, ხოლო დახარჯული ძაფის სიგრძე იქნება ლურსმნებს შორის მანძილი.
მინიმუმ რა სიგრძის ძაფის დახარჯვა მოგვიწევს იმისათვის, რომ ყველა ლურსმანს მობმული ჰქონდეს ძაფი.
*/


int main() {
    int N;
    cin >> N;
    vector <int> a(N);
    vector <int> dp(N);

    for (int i = 0; i < N; i++){
        cin >> a[i];
    }

    for(int i = 0; i < N; i++){
        for(int j = i + 1; j < N; j++){
            if(a[i] > a[j]){
                int temp = a[i];
                a[i] = a[j];
                a[j] = temp;
            }
        }
    }

    dp[1] = a[1] - a[0];
    dp[2] = dp[1] + a[2] - a[1];
    for (int i = 3; i < N; i++){
        dp[i] = min(dp[i - 1], dp[i - 2]);
        dp[i] += a[i] - a[i - 1];
    }

    cout << dp[N - 1];

    return 0;
}
