#include <bits/stdc++.h>

using namespace std;
/*
ბაჭია ბაბის ისე ეჩქარება და ისე გარბის კიბეზე, რომ საფეხურიდან საფეხურზე გადახტომას ვერ ახერხებს, აუცილებლად ტოვებს ან ერთს, ან ორ საფეხურს.
კიბის საფეხურების რაოდენობაა n.
ბაბის აინტერესებს, ბოლო საფეხურზე ასვლის რამდენი ვარიანტი აქვს. პროგრამისტებო, დაეხმარეთ.*/
int main() {
    int N;
    cin >> N;
    vector <int> dp(N + 1);

    dp[1] = 0;
    dp[2] = 1;
    dp[3] = 1;

    for(int i = 4; i <= N; i++){
        dp[i] = dp[i - 2] + dp[i - 3];
    }

    cout << dp[N];

    return 0;
}

