
#include <bits/stdc++.h>

using namespace std;


/*საბავშვო მოედნის გარშემო N
 რაოდენობის სკამია განლაგებული და, რა თქმა უნდა, გადანომრილია 1-დან N
-ის ჩათვლით.
ორმა მეგობარმა, გიგიკომ და გუგიკომ სხვადასხვა დროს შეიძინეს ბილეთები საბავშვო კონცერტზე დასასწრებად. თითოეულ ბილეთს სკამის ნომერი აწერია.
მეგობრებს ძალიან უნდათ ერთმანეთის გვერდით ჯდომა.
დაწერეთ პროგრამა, რომელიც გამოთვლის თუ, სულ მცირე, რამდენ ბავშვს უნდა გაუცვალოს გიგიკომ ადგილი, რომ  გუგიკოს გვერდით აღმოჩნდეს.
ცნობილია, რომ ადგილის გაცვლა ნებადართულია მხოლოდ იმ ბავშვთან, რომელიც მეზობელ სკამზე ზის.*/

int main() {
    int N, gig, gug;
    cin >> N >> gig >> gug;

    if((gig == N && gug == 1) || (gug == N && gig == 1) || (gug + 1 == gig) || (gig + 1 == gug)){
        cout << 0;
    }else{
        if(gug > gig){
            if(gug - gig > (N - gug) + (gig - 1)){
                cout << (N - gug) + (gig - 1);
            }else{
                cout << gug - gig - 1;
            }
        }else{
            if(gig - gug > (N - gig) +  (gug - 1))
            {
                cout << (N - gig) + (gug - 1);
            }else{
                cout << gig - gug - 1;
            }
        }
    }

    return 0;
}
