#include <bits/stdc++.h>

using namespace std;

/*
პატარა თინიკო ძალიან ხალისობს ხოლმე კიბეზე თამაშისას. დღეს მან გადაწყვიტა შემდეგნაირად ითამაშოს:
უნდა დადგეს კიბის დასაწყისში (ქვემოთ) და უნდა მიაღწიოს კიბის ბოლოს (ყველაზე ზედა საფეხურს), ოღონდ ისე, რომ ერთ სვლაზე ერთი ან ორი საფეხურით მაღლა გადაინაცვლოს ხოლმე.
საქმეს ის ართულებს, რომ კიბის ერთ-ერთი საფეხური ჩატეხილია და თინიკოს მასზე დაბიჯება არ შეუძლია.

გამოთვალეთ, სვლების რამდენი განსხვავებული ვარიანტით შეიძლება მოხვდეს თინიკო კიბის ყველაზე ზედა საფეხურზე.
*/

int main() {
    int N, x;
    cin >> N >> x;
    vector <int> dp(N + 1);

    dp[0] = 1;
    if(x == 1){
        dp[1] = 0;
    }else{
        dp[1] = 1;
    }

    for(int i = 2; i <= N; i++){
        if(x == i){
            dp[i] = 0;
            dp[i + 1] = dp[i - 1];
        }else{
            dp[i] = dp[i - 1] + dp[i - 2];
        }
    }

    cout << dp[N];
    return 0;
}
