#include <bits/stdc++.h>

using namespace std;

/*
საქართველოში ინტერნეტის ხარისხის გაუმჯობესების მიზნით 5G ანძების დამონტაჟება იწყება. ტენდერში ერთ-ერთმა რეიტინგულმა კომპანიამ, "AIA-BUILDING"-მა გაიმარჯვა.
პროექტის დაგეგმარებისას გადაწყდა, რომ ანძები ქვეყანაში წრფივად უნდა განთავსდეს, თანაც ისე, რომ გვერდიგვერდ მდგომი ანძები რაც შეიძლება შორს იყოს ერთმანეთისგან,
რათა უფრო დიდი ტერიტორია დაიფაროს 5G ინტერნეტით.

რუკაზე წრფივად მოინიშნა N ადგილი, სადაც შესაძლებელია ანძის დამონტაჟება. ქვეყანაში სულ K ანძა უნდა დაყენდეს.
თქვენ ამავე კომპანიის პროგრამისტი ხართ და დაგევალათ შეარჩიოთ რუკაზე აღნიშნული N წერტილიდან ისეთი K
 ცალი წერტილი, რომ გვერდიგვერდ მდგომ ანძებს შორის მინიმალური დაშორება გამოვიდეს რაც შეიძლება დიდი (მაქსიმალური).
*/

int main() {
    unsigned long long N, K;
    cin >> N >> K;
    vector <unsigned long long> a(N + 1);
    for(int i = 1; i <= N; i++){
        cin >> a[i];
    }

    sort(a.begin() + 1, a.end());

    unsigned long long l = 1, r = a[N] - a[1], m, ans = 1;
    while(l <= r){
        m = l + (r - l) / 2;
        unsigned long long cur = a[1];
        unsigned long long cnt = 1;
        for(int i = 2; i <= N; i++){
            if(a[i] - cur >= m){
                cnt++;
                cur = a[i];
            }
        }
        if(cnt >= K){
            ans = m;
            l = m + 1;
        }else r = m - 1;
    }

    cout << ans;

    return 0;
}
