#include <bits/stdc++.h>

using namespace std;

/*
პირველკლასელს აქვს სტრიქონი, რომელშიც ერთნიშნა რიცხვების ჯამი ან სხვაობაა ჩაწერილი. მაგ.: 2+3, ან 5-7.
ანუ სტრიქონი შედგება სამი სიმბოლოსაგან, რომელთაგან პირველი და ბოლო აუცილებლად ციფრია, ხოლო შუა სიმბოლო წარმოადგენს '+' ან '-' სიმბოლოს (აპოსტროფების გარეშე).
დაეხმარეთ პირველკლასელს და დაუწერეთ პროგრამა, რომელიც იანგარიშებს მოცემული სტრიქონის რიცხვით მნიშვნელობას.
*/

int main() {
    string str;
    cin >> str;

    int res = 0;
    if(str[1] == '+'){
        res = (str[0] - '0') + (str[2] - '0');
    }else{
        res = (str[0] - '0') - (str[2] - '0');
    }

    cout << res;

    return 0;
}
