#include <bits/stdc++.h>

using namespace std;

/*
ერთი უცნაური ქვეყნის უცნაურ საბაჟოზე უცნაური კიბე დგას. ქვეყანაში შემომსვლელი ნებისმიერი ტურისტი ვალდებულია ამ კიბეზე ავიდეს.
კიბის თითოეულ საფეხურს აწერია ნატურალური რიცხვი, რაც ნიშნავს, რომ თუ ამ საფეხურზე დააბიჯებ, ზუსტად იმდენ თანხას იხდი, რა რიცხვიც აწერია მას.
ტურისტს უფლება აქვს გამოტოვოს ერთი საფეხური, როცა უნდა და რამდენჯერაც უნდა.

დაეხმარეთ ტურისტს იმის გარკვევაში, მინიმუმ რა რაოდენობის თანხის გადახდა მოუწევს კიბეზე ასვლის შემდეგ, თუკი მოხერხებულად გამოიყენებს საფეხურის გამოტოვების უფლებას.
*/

int main() {
    int N;
    cin >> N;

    long long d[N + 1], a[N + 1];
    int num;
    for(int i = 1; i <= N; i++){
        cin >> num;
        a[i] = num;
    }

    d[1] = a[1];
    d[2] = a[2];

    for(int i = 3; i <= N; i++){
        d[i] = min(d[i - 1], d[i - 2]) + a[i];
    }

    cout << d[N];
    return 0;
}
